//=============================================================================
//
// Collider [Collider.h]
// Author : GP11B132 14 ゴショウケン
//
//=============================================================================
#include "Collider2D.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//#define PLAYER_MAX		(1)		// プレイヤーのMax人数

//*****************************************************************************
// グローバル変数  "private"
//*****************************************************************************



//*****************************************************************************
// プロトタイプ宣言   "private"
//*****************************************************************************


//*****************************************************************************
//"public"
//*****************************************************************************
void SetCollider(Collider2dStruct &collider2d, ColliderType type, D3DXVECTOR2 pos, float rotate, float width, float height, bool use)
{
	collider2d.use = use;
	collider2d.Type = type;
	collider2d.pos = pos;
	collider2d.rotate = rotate;
	collider2d.width = width;
	collider2d.height = height;
}

void UpdateCollider(Collider2dStruct & collider2d, D3DXVECTOR2 pos, float rotate)
{
	collider2d.pos = pos;
	collider2d.rotate = rotate;
}

void SetColliderEnable(Collider2dStruct & collider2d, bool use)
{
	collider2d.use = use;
}

//*****************************************************************************
// "private"
//*****************************************************************************
